// JavaScript Break and Continue Statement Practice:

/*
ধর, তুই 1 থেকে 30 পর্যন্ত সংখ্যা প্রিন্ট করতে চাস, কিন্তু তোর ইচ্ছা হলো, 15-এর পরে প্রিন্ট করা বন্ধ হবে, থেমে যাবে।
 */
for(let i = 1; i <= 30; i++){
    console.log(i);
    if(i >= 15){
        break;
    }
}

/*
তুই 1 থেকে 40 পর্যন্ত সংখ্যা প্রিন্ট করতে চাস, কিন্তু এমনভাবে, যেন 7 দিয়ে বিভাজ্য সংখ্যাগুলো বাদ যায়। যেমন- 7, 14, 21, ইত্যাদি বাদ যাবে। একটা প্রোগ্রাম লিখ, যেখানে এই সংখ্যাগুলো স্কিপ হবে।
 */
for(let x = 1; x <= 40; x++){
    if((x % 7) === 0){
        continue;
    }
    console.log("7 diye bibajo numbers skip: ", x);
}

/*
তুই 1 থেকে 15 পর্যন্ত সংখ্যা প্রিন্ট করতে চাস, কিন্তু 9 বাদে। একটা প্রোগ্রাম লিখ, যেখানে 9 স্কিপ হয়ে যাবে আর বাকিসব সংখ্যা প্রিন্ট হবে।
*/
for(let i = 1; i <= 15; i++){
    if(i === 9){
        continue;
    }
    console.log("no 9 skip", i);
}

/*
1 থেকে 20 পর্যন্ত সংখ্যা প্রিন্ট কর, কিন্তু 12 বাদে। 12 স্কিপ হয়ে যাবে এবং বাকিসব সংখ্যা প্রিন্ট হবে।
 */
for(let i = 1; i <= 20; i++){
    if(i === 12){
        continue;
    }
    console.log("the 12 no skip", i);
}

/*
1 থেকে 25 পর্যন্ত সংখ্যা প্রিন্ট কর, কিন্তু 3 দিয়ে বিভাজ্য সংখ্যা বাদ যাবে।
 */
for(let i = 1; i <= 25; i++){
    if(i % 3 === 0){
        continue;
    }
    console.log("3 diye bibajo numbers skip -", i)
}

/*
91 থেকে 120 পর্যন্ত সংখ্যা প্রিন্ট কর, কিন্তু 10 দিয়ে ভাগ যায়, এমন সংখ্যা পেলে প্রিন্ট করা বন্ধ হয়ে যাবে, থেমে যাবে।
 */
for(let i = 91; i <= 120; i++){
    if(i % 10 === 0){
        break;
    }    console.log("break if any number divide by 10 -",i)
}